n0xius/sxcore_firmware/libraries/GD32F3x0_Firmware_Library_V2.0.1/Examples/USBFS/USB_Device/Audio/src/gd32f3x0_audio_codec.c
/*!
    \file  gd32f3x0_audio_codec.c
    \brief this file contains all the audio codec low layer driver

    \version 2017-06-06, V1.0.0, firmware for GD32F3x0
    \version 2019-06-01, V2.0.0, firmware for GD32F3x0
*/

/*
    Copyright (c) 2019, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/  

#include "gd32f3x0_audio_codec.h"

/* Mask for the bit EN of the I2S CFGR register */
#define I2S_ENABLE_MASK                 (0x0400)

/* delay for the Codec to be correctly reset */
#define CODEC_RESET_DELAY               (0x4FFF)

/* Codec audio Standards */
#ifdef I2S_STANDARD_PHILLIPS
    #define CODEC_STANDARD                 0x04
    #define I2S_STANDARD                   I2S_STD_PHILLIPS
#elif defined(I2S_STANDARD_MSB)
    #define CODEC_STANDARD                 0x00
    #define I2S_STANDARD                   I2S_STD_MSB
#elif defined(I2S_STANDARD_LSB)
    #define CODEC_STANDARD                 0x08
    #define I2S_STANDARD                   I2S_STD_LSB
#else 
    #error "Error: No audio communication standard selected !"
#endif /* I2S_STANDARD */

/* The 7 bits Codec adress (sent through I2C interface) */
#define CODEC_ADDRESS                      0x94  /* b00100111 */

/* This structure is declared global because it is handled by two different functions */
static dma_parameter_struct dma_initstructure;
static uint8_t outputdev = 0;

uint32_t audiototalsize = 0xFFFF; /* This variable holds the total size of the audio file */
uint32_t audioremsize   = 0xFFFF; /* This variable holds the remaining data in audio file */
uint16_t *currentpos;             /* This variable holds the current position of audio pointer */
uint32_t i2s_audiofreq = 0;

/* Audio Codec functions */

/* Low layer codec functions */
static void     codec_ctrlinterface_init    (void);
static void     codec_ctrlinterface_deinit  (void);
static void     codec_audiointerface_init   (uint32_t audiofreq);
static void     codec_audiointerface_deinit (void);
static void     codec_reset                 (void);
static uint32_t codec_writeregister         (uint32_t registeraddr, uint32_t registervalue);
static void     codec_gpio_init             (void);
static void     codec_gpio_deinit           (void);
static void     delay                       (__IO uint32_t ncount);

/*!
    \brief      configure the audio peripherals
    \param[in]  outputdevice:
                    @arg OUTPUT_DEVICE_SPEAKER
                    @arg OUTPUT_DEVICE_HEADPHONE
                    @arg OUTPUT_DEVICE_BOTH
                    @arg OUTPUT_DEVICE_AUTO	              
    \param[in]  volume: Initial volume level (from 0 (Mute) to 100 (Max))
	\param[in]  audiofreq: Audio frequency used to play the audio stream
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t eval_audio_init(uint16_t outputdevice, uint8_t volume, uint32_t audiofreq)
{
    /* Perform low layer Codec initialization */
    if (codec_init(outputdevice, VOLUME_CONVERT(volume), audiofreq) != 0) {
        return 1;
    } else {
        /* I2S data transfer preparation:
           Prepare the Media to be used for the audio transfer from memory to I2S peripheral */
        audio_mal_init();

        /* Return 0 when all operations are OK */
        return 0;
    }
}

/*!
    \brief      deinitializes all the resources used by the codec (those initialized 
                by eval_audio_init() function) EXCEPT the I2C resources since they are 
                used by the IOExpander as well (and eventually other modules).           
    \param[in]  none
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t eval_audio_deinit(void)
{
    /* deinitialize the media layer */
    audio_mal_deinit();

    /* deinitialize codec */
    codec_deinit();

    return 0;
}

/*!
    \brief      configure the audio peripherals
    \param[in]  pbuffer: Pointer to the buffer             
    \param[in]  size: number of audio data bytes
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t eval_audio_play(uint16_t* pbuffer, uint32_t size)
{
    /* Set the total number of data to be played (count in half-word) */
    audiototalsize = size/2;

    /* Call the audio Codec Play function */
    codec_play();

    /* Update the Media layer and enable it for play */  
    audio_mal_play((uint32_t)pbuffer, (uint32_t)(DMA_MAX(audiototalsize / 2)));

    /* Update the remaining number of data to be played */
    audioremsize = (size/2) - DMA_MAX(audiototalsize);

