n0xius/sxcore_firmware/libraries/GD32F3x0_Firmware_Library_V2.0.1/Examples/USBFS/USB_Device/Audio/src/gd32f3x0_audio_codec.c
    /* Update the current audio pointer position */
    currentpos = pbuffer + DMA_MAX(audiototalsize);

    return 0;
}

/*!
    \brief      this function pauses or resumes the audio file stream. in case
                of using DMA, the DMA pause feature is used. in all cases the i2s 
                peripheral is disabled
    \param[in]  cmd: AUDIO_PAUSE (or 0) to pause, AUDIO_RESUME (or any value different from 0) to resume
    \param[in]  addr: Address from/at which the audio stream should resume/pause	
    \param[in]  size: number of data to be configured for next resume
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t eval_audio_pauseresume(uint32_t cmd, uint32_t addr, uint32_t size)
{
    if (cmd != AUDIO_PAUSE) {
        /* Call the Media layer pause/resume function */
        audio_mal_pauseresume(cmd, addr, size);

        /* Call the Audio Codec Pause/Resume function */
        if (codec_pauseresume(cmd) != 0) {
            return 1;
        } else {
            return 0;
        }
    } else {
        /* Call the Audio Codec Pause/Resume function */
        if (codec_pauseresume(cmd) != 0) {
            return 1;
        } else {
            /* Call the Media layer pause/resume function */
            audio_mal_pauseresume(cmd, addr, size);

            /* Return 0 if all operations are OK */
            return 0;
        }
    }
} 

/*!
    \brief      stops audio playing and power down the audio codec
    \param[in]  option: 
	                This parameter can be any one of the following values:
                        @arg CODEC_PDWN_SW for software power off (by writing registers)
                                           then no need to reconfigure the codec after power on.
                        @arg CODEC_PDWN_HW completely shut down the codec (physically). Then need 
                                           to reconfigure the codec after power on
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t eval_audio_stop(uint32_t option)
{
    /* call audio codec stop function */
    if (codec_stop(option) != 0) {
        return 1;
    } else {
        /* call media layer stop function */
        audio_mal_stop();

        /* update the remaining data number */
        audioremsize = audiototalsize;    

        /* return 0 when all operations are correctly done */
        return 0;
    }
}

/*!
    \brief      controls the current audio volume level
    \param[in]  volume: volume level to be set in percentage from 0% to 100% (0 for Mute and 100 for Max volume level).
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t eval_audio_volumectl(uint8_t volume)
{
    /* Call the codec volume control function with converted volume value */
    return (codec_volumectrl(VOLUME_CONVERT(volume)));
}

/*!
    \brief      enable or disable the MUTE mode by software
    \param[in]  cmd: could be AUDIO_MUTE_ON to mute sound or AUDIO_MUTE_OFF to unmute the codec and restore previous volume level
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t eval_audio_mute(uint32_t cmd)
{
    /* Call the Codec Mute function */
    return (codec_mute(cmd));
}

/*!
    \brief      this function handles main Media layer interrupt
    \param[in]  none
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
void Audio_MAL_IRQHandler(void)
{    
#ifndef AUDIO_MAL_MODE_NORMAL
    uint16_t *pAddr = (uint16_t *)currentpos;
    uint32_t Size = audioremsize;
#endif /* AUDIO_MAL_MODE_NORMAL */
}

/* CS43L22 Audio Codec Control Functions */

/*!
    \brief      initializes the audio codec and all related interfaces (control interface: I2C and audio interface: I2S)
    \param[in]  outputdevice:
                    this parameter can be any one of the following values:
                        @arg OUTPUT_DEVICE_SPEAKER
                        @arg OUTPUT_DEVICE_HEADPHONE
                        @arg OUTPUT_DEVICE_BOTH
                        @arg OUTPUT_DEVICE_AUTO
    \param[in]  volume: initial volume level (from 0 (Mute) to 100 (Max))
    \param[in]  audiofreq: audio frequency used to play the audio stream
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t codec_init(uint16_t outputdevice, uint8_t volume, uint32_t audiofreq)
{
    uint32_t counter = 0;

    /* Configure the Codec related IOs */
    codec_gpio_init();

    /* Reset the Codec Registers */
    codec_reset();

    /* Initialize the Control interface of the Audio Codec */
    codec_ctrlinterface_init();

    /* Keep Codec powered OFF */
    counter += codec_writeregister(0x02, 0x01);

    switch (outputdevice) {
        case OUTPUT_DEVICE_SPEAKER:
            counter += codec_writeregister(0x04, 0xFA); /* SPK always ON & HP always OFF */
            outputdev = 0xFA;
            break;

        case OUTPUT_DEVICE_HEADPHONE:
            counter += codec_writeregister(0x04, 0xAF); /* SPK always OFF & HP always ON */
            outputdev = 0xAF;
            break;

        case OUTPUT_DEVICE_BOTH:
            counter += codec_writeregister(0x04, 0xAA); /* SPK always ON & HP always ON */
            outputdev = 0xAA;
            break;

        case OUTPUT_DEVICE_AUTO:
            counter += codec_writeregister(0x04, 0x05); /* Detect the HP or the SPK automatically */
            outputdev = 0x05;
            break;

        default:
            counter += codec_writeregister(0x04, 0x05); /* Detect the HP or the SPK automatically */
            outputdev = 0x05;
            break;
    }

    /* Clock configuration: Auto detection */  
    counter += codec_writeregister(0x05, 0x81);

    /* Set the Slave Mode and the audio Standard */  
    counter += codec_writeregister(0x06, CODEC_STANDARD);

    /* Set the Master volume */
    codec_volumectrl(volume);

    /* If the Speaker is enabled, set the Mono mode and volume attenuation level */
    if (outputdevice != OUTPUT_DEVICE_HEADPHONE) {
        /* Set the Speaker Mono mode */
        counter += codec_writeregister(0x0F , 0x06);

        /* Set the Speaker attenuation level */
        counter += codec_writeregister(0x24, 0x00);
        counter += codec_writeregister(0x25, 0x00);
    }

    /* Power on the Codec */
    counter += codec_writeregister(0x02, 0x9E);

    /* Additional configuration for the CODEC. These configurations are done to reduce
       the time needed for the Codec to power off. If these configurations are removed,
       then a long delay should be added between powering off the Codec and switching
       off the I2S peripheral MCLK clock (which is the operating clock for Codec).
       If this delay is not inserted, then the codec will not shut down propoerly and
       it results in high noise after shut down. */

    /* Disable the analog soft ramp */
    counter += codec_writeregister(0x0A, 0x00);

