n0xius/sxcore_firmware/libraries/GD32F3x0_Firmware_Library_V2.0.1/Examples/USBFS/USB_Device/Audio/src/gd32f3x0_audio_codec.c
    /* Disable the digital soft ramp */
    counter += codec_writeregister(0x0E, 0x04);

    /* Disable the limiter attack level */
    counter += codec_writeregister(0x27, 0x00);

    /* Adjust Bass and Treble levels */
    counter += codec_writeregister(0x1F, 0x0F);

    /* Adjust PCM volume level */
    counter += codec_writeregister(0x1A, 0x0A);
    counter += codec_writeregister(0x1B, 0x0A);

    /* Configure the I2S peripheral */
    codec_audiointerface_init(audiofreq);

    /* Return communication control value */
    return counter;
}

/*!
    \brief      restore the audio codec state to default state and free all used resources
    \param[in]  none
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t codec_deinit(void)
{
    uint32_t counter = 0;

    /* Reset the Codec Registers */
    codec_reset();

    /* Keep Codec powered OFF */
    counter += codec_writeregister(0x02, 0x01);    

    /* Deinitialize all use GPIOs */
    codec_gpio_deinit();

    /* Disable the Codec control interface */
    codec_ctrlinterface_deinit();

    /* Deinitialize the Codec audio interface (I2S) */
    codec_audiointerface_deinit(); 

    /* Return communication control value */
    return counter;  
}

/*!
    \brief      start the audio codec play feature
    \param[in]  none
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t codec_play(void)
{
    /* No actions required on Codec level for play command */

    /* Return communication control value */
    return 0;
}


/*!
    \brief      pauses and resumes playing on the audio codec
    \param[in]  cmd: AUDIO_PAUSE (or 0) to pause, AUDIO_RESUME (or any value different from 0) to resume
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t codec_pauseresume(uint32_t cmd)
{
    uint32_t counter = 0;

    /* Pause the audio file playing */
    if (cmd == AUDIO_PAUSE) {
        /* Mute the output first */
        counter += codec_mute(AUDIO_MUTE_ON);

        /* Put the Codec in Power save mode */
        counter += codec_writeregister(0x02, 0x01);
    } else { /* AUDIO_RESUME */
        /* Unmute the output first */
        counter += codec_mute(AUDIO_MUTE_OFF);

        counter += codec_writeregister(0x04, outputdev);

        /* Exit the Power save mode */
        counter += codec_writeregister(0x02, 0x9E); 
    }

    return counter;
}

/*!
    \brief      stops audio codec playing. it powers down the codec
    \param[in]  codecpdwnmode:
                    this parameter can be any one of the following values:
                        @arg CODEC_PDWN_SW: only mutes the audio codec. when resuming from this mode the 
						                    codec keeps the prvious initialization (no need to re-Initialize the codec registers)
                        @arg CODEC_PDWN_HW: physically power down the codec. when resuming from this mode,
                                            the codec is set to default configuration (user should re-Initialize the codec in order
											to play again the audio stream)
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t codec_stop(uint32_t codecpdwnmode)
{
    uint32_t counter = 0;   

    /* Mute the output first */
    codec_mute(AUDIO_MUTE_ON);

    if (codecpdwnmode == CODEC_PDWN_SW) {
        /* Power down the DAC and the speaker (PMDAC and PMSPK bits)*/
        counter += codec_writeregister(0x02, 0x9F);
    } else {/* CODEC_PDWN_HW */
        /* Power down the DAC components */
        counter += codec_writeregister(0x02, 0x9F);

        /* Wait at least 100ms */
        delay(0xFFF);

        /* Reset The pin */
        //IOE_WriteIOPin(AUDIO_RESET_PIN, BitReset);
    }

    return counter;
}

/*!
    \brief      highers or lowers the codec volume level
    \param[in]  volume: a byte value from 0 to 255 (refer to codec registers description for more details)
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t codec_volumectrl(uint8_t volume)
{
    uint32_t counter = 0;

    if (volume > 0xE6) {
        /* Set the Master volume */
        counter += codec_writeregister(0x20, volume - 0xE7);
        counter += codec_writeregister(0x21, volume - 0xE7);
    } else {
        /* Set the Master volume */
        counter += codec_writeregister(0x20, volume + 0x19);
        counter += codec_writeregister(0x21, volume + 0x19);
    }

    return counter;
}

/*!
    \brief      enables or disables the mute feature on the audio codec
    \param[in]  cmd: AUDIO_MUTE_ON to enable the mute or AUDIO_MUTE_OFF to disable the mute mode
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t codec_mute(uint32_t cmd)
{
    uint32_t counter = 0;

    /* Set the Mute mode */
    if (cmd == AUDIO_MUTE_ON) {
        counter += codec_writeregister(0x04, 0xFF);

        //counter += codec_writeregister(0x0D, 0x63);
        //counter += codec_writeregister(0x0F, 0xF6);
    } else { /* AUDIO_MUTE_OFF Disable the Mute */
        counter += codec_writeregister(0x04, outputdev);

        //counter += codec_writeregister(0x0D, 0x60);
        //counter += codec_writeregister(0x0F, 0x06);
    }

    return counter;
}

/*!
    \brief      reset the audio codec
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void codec_reset(void)
{
    /* Configure the IO Expander (to use the Codec Reset pin mapped on the IOExpander) */
    //IOE_Config();

    /* Power Down the codec */
    //IOE_WriteIOPin(AUDIO_RESET_PIN, BitReset);

    /* wait for a delay to insure registers erasing */
    //delay(CODEC_RESET_DELAY); 

    /* Power on the codec */
    //IOE_WriteIOPin(AUDIO_RESET_PIN, BitSet);
}


/*!
    \brief      switch dynamically (while audio file is played) the output target (speaker or headphone)	
    \param[in]  output:
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t codec_switchoutput(uint8_t output)
{
    uint8_t counter = 0;

