n0xius/sxcore_firmware/libraries/GD32F3x0_Firmware_Library_V2.0.1/Examples/USBFS/USB_Device/Audio/src/gd32f3x0_audio_codec.c
    switch (output) {
        case OUTPUT_DEVICE_SPEAKER:
            counter += codec_writeregister(0x04, 0xFA); /* SPK always ON & HP always OFF */
            outputdev = 0xFA;
            break;

        case OUTPUT_DEVICE_HEADPHONE:
            counter += codec_writeregister(0x04, 0xAF); /* SPK always OFF & HP always ON */
            outputdev = 0xAF;
            break;

        case OUTPUT_DEVICE_BOTH:
            counter += codec_writeregister(0x04, 0xAA); /* SPK always ON & HP always ON */
            outputdev = 0xAA;
            break;

        case OUTPUT_DEVICE_AUTO:
            counter += codec_writeregister(0x04, 0x05); /* Detect the HP or the SPK automatically */
            outputdev = 0x05;
            break;    

        default:
            counter += codec_writeregister(0x04, 0x05); /* Detect the HP or the SPK automatically */
            outputdev = 0x05;
            break;
    }

    return counter;
}

/*!
    \brief      writes a byte to a given register into the audio codec through the control interface (I2C)
    \param[in]  register_addr: The address (location) of the register to be written
    \param[in]  register_value: the Byte value to be written into destination register
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
static uint32_t codec_writeregister(uint32_t register_addr, uint32_t register_value)
{
    uint32_t result = 0;

    /* Return the verifying value: 0 (Passed) or 1 (Failed) */
    return result;
}

/*!
    \brief      none
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void codec_ctrlinterface_init(void)
{

}

/*!
    \brief      restore the Audio Codec control interface to its default state
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void codec_ctrlinterface_deinit(void)
{
    /* Disable the I2C peripheral */ 
    /* This step is not done here because the I2C interface can be used by other modules */
    /* I2C_DeInit(CODEC_I2C); */
}

/*!
    \brief      initializes the Audio Codec audio interface (I2S)
    \param[in]  audiofreq: audio frequency to be configured for the I2S peripheral
    \param[out] none
    \retval     none
*/
static void codec_audiointerface_init(uint32_t audiofreq)
{
    i2s_audiofreq = audiofreq;

    /* enable the CODEC_I2S peripheral clock */
    rcu_periph_clock_enable(CODEC_I2S_CLK);

    /* CODEC_I2S peripheral configuration */
    spi_i2s_deinit(CODEC_I2S);

    /* CODEC_I2S peripheral configuration */
    i2s_psc_config(CODEC_I2S, audiofreq, I2S_FRAMEFORMAT_DT16B_CH16B, 
#ifdef CODEC_MCLK_ENABLED
                   I2S_MCKOUT_ENABLE
#elif defined(CODEC_MCLK_DISABLED)
                   I2S_MCKOUT_DISABLE
#endif
    );

    i2s_init(CODEC_I2S, I2S_MODE_MASTERTX, I2S_STD_LSB, I2S_CKPL_HIGH);

    /* enable the I2S DMA TX request */
    spi_dma_enable(CODEC_I2S, SPI_DMA_TRANSMIT);
    /* The I2S peripheral will be enabled only in the eval_audio_play() function 
       or by user functions if DMA mode not enabled */  
}

/*!
    \brief      restores the Audio Codec audio interface to its default state.
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void codec_audiointerface_deinit(void)
{
    /* disable the CODEC_I2S peripheral (in case it hasn't already been disabled) */
    i2s_disable(CODEC_I2S);

    /* deinitialize the CODEC_I2S peripheral */
    spi_i2s_deinit(CODEC_I2S);

    /* disable the CODEC_I2S peripheral clock */
    rcu_periph_clock_disable(CODEC_I2S_CLK);
}

/*!
    \brief      initializes IOs used by the Audio codec (on the control and audio interfaces).
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void codec_gpio_init(void)
{
    /* enable the GPIO clock */
    rcu_periph_clock_enable(CODEC_I2S_GPIO_CLOCK);
    /* enable I2S0 clock */
    rcu_periph_clock_enable(CODEC_I2S_CLK);
    /* configure GPIO: WS, SCK and SD pins */
    gpio_af_set(CODEC_I2S_GPIO, GPIO_AF_0, CODEC_I2S_WS_PIN | CODEC_I2S_SCK_PIN | CODEC_I2S_SD_PIN);
    gpio_mode_set(CODEC_I2S_GPIO, GPIO_MODE_AF, GPIO_PUPD_NONE, CODEC_I2S_WS_PIN | CODEC_I2S_SCK_PIN | CODEC_I2S_SD_PIN);
    gpio_output_options_set(CODEC_I2S_GPIO, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, CODEC_I2S_WS_PIN | CODEC_I2S_SCK_PIN | CODEC_I2S_SD_PIN); 

#ifdef CODEC_MCLK_ENABLED
    /* CODEC_I2S pins configuration: MCK pin */
    gpio_af_set(CODEC_I2S_GPIO, GPIO_AF_0, CODEC_I2S_MCK_PIN);
    gpio_mode_set(CODEC_I2S_GPIO, GPIO_MODE_AF, GPIO_PUPD_NONE, CODEC_I2S_MCK_PIN);
    gpio_output_options_set(CODEC_I2S_GPIO, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, CODEC_I2S_MCK_PIN); 
#endif /* CODEC_MCLK_ENABLED */
}


/*!
    \brief      restores the IO used by the audio codec interface to their default state
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void codec_gpio_deinit(void)
{
    /* deinitialize all the GPIOs used by the driver (EXCEPT the I2C IOs since they are used by the IOExpander as well) */
    gpio_mode_set(CODEC_I2S_GPIO, GPIO_MODE_INPUT, GPIO_OSPEED_50MHZ, CODEC_I2S_WS_PIN | CODEC_I2S_SCK_PIN | CODEC_I2S_SD_PIN);

#ifdef CODEC_MCLK_ENABLED
    /* CODEC_I2S pins deinitialization: MCK pin */
    gpio_mode_set(CODEC_I2S_GPIO, GPIO_MODE_INPUT, GPIO_OSPEED_50MHZ, CODEC_I2S_MCK_PIN);
#endif /* CODEC_MCLK_ENABLED */
}

/*!
    \brief      inserts a delay time (not accurate timing)
    \param[in]  ncount: specifies the delay time length
    \param[out] none
    \retval     none
*/
static void delay( __IO uint32_t ncount)
{
    for (; ncount != 0; ncount--);
}

#ifdef USE_DEFAULT_TIMEOUT_CALLBACK

/*!
    \brief      basic management of the timeout situation
    \param[in]  none
    \param[out] none
    \retval     none
*/
uint32_t Codec_TIMEOUT_UserCallback(void)
{
    /* block communication and all processes */
    while (1)
    {
    }
}
#endif /* USE_DEFAULT_TIMEOUT_CALLBACK */

/* Audio MAL Interface Control Functions */

/*!
    \brief      initializes and prepares the media to perform audio data transfer from media to the I2S peripheral
    \param[in]  none
    \param[out] none
    \retval     none
*/
void audio_mal_init(void)  
{   
    /* enable the DMA clock */
    rcu_periph_clock_enable(AUDIO_MAL_DMA_CLOCK);

    /* configure the DMA Stream */
    dma_channel_enable(AUDIO_MAL_DMA_CHANNEL);
    dma_deinit(AUDIO_MAL_DMA_CHANNEL);

