n0xius/sxcore_firmware/libraries/GD32F3x0_Firmware_Library_V2.0.1/Examples/USBFS/USB_Device/Audio/src/gd32f3x0_audio_codec.c
    /* Set the parameters to be configured */
    dma_initstructure.periph_addr = CODEC_I2S_ADDRESS;
    dma_initstructure.memory_addr = (uint32_t)0;/* This field will be configured in play function */
    dma_initstructure.direction = DMA_MEMORY_TO_PERIPHERAL;
    dma_initstructure.number = (uint32_t)0xFFFE;/* This field will be configured in play function */
    dma_initstructure.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
    dma_initstructure.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
    dma_initstructure.periph_width = DMA_PERIPHERAL_WIDTH_16BIT;
    dma_initstructure.memory_width = DMA_MEMORY_WIDTH_16BIT;

#ifdef AUDIO_MAL_MODE_NORMAL
    dma_circulation_disable(AUDIO_MAL_DMA_CHANNEL);
#elif defined(AUDIO_MAL_MODE_CIRCULAR)
    dma_circulation_enable(AUDIO_MAL_DMA_CHANNEL);
#else
    #error "AUDIO_MAL_MODE_NORMAL or AUDIO_MAL_MODE_CIRCULAR should be selected !!"
#endif /* AUDIO_MAL_MODE_NORMAL */  

    dma_initstructure.priority = DMA_PRIORITY_HIGH;
    dma_init(AUDIO_MAL_DMA_CHANNEL, &dma_initstructure);

    /* enable the I2S DMA request */
    spi_dma_enable(CODEC_I2S, SPI_DMA_TRANSMIT);
}

/*!
    \brief      restore default state of the used media
    \param[in]  none
    \param[out] none
    \retval     none
*/
void audio_mal_deinit(void)  
{
    /* disable the DMA Channel before the deinit */
    dma_channel_disable(AUDIO_MAL_DMA_CHANNEL);

    /* dinitialize the DMA Channel */
    dma_deinit(AUDIO_MAL_DMA_CHANNEL);

    /* the DMA clock is not disabled, since it can be used by other streams */
}

/*!
    \brief      starts playing audio stream from the audio media
    \param[in]  addr: pointer to the audio stream buffer
    \param[in]  size: number of data in the audio stream buffer
    \param[out] none
    \retval     none
*/
void audio_mal_play(uint32_t addr, uint32_t size)
{
    /* enable the I2S DMA stream */
    dma_channel_disable( AUDIO_MAL_DMA_CHANNEL);

    /* clear the interrupt flag */
    dma_interrupt_flag_clear(AUDIO_MAL_DMA_CHANNEL, DMA_INT_FLAG_FTF);

    /* configure the buffer address and size */
    dma_initstructure.memory_addr = (uint32_t)addr;
    dma_initstructure.number = (uint32_t)(size*2);

    /* configure the DMA stream with the new parameters */
    dma_init(AUDIO_MAL_DMA_CHANNEL, &dma_initstructure);

    /* enable the I2S DMA stream */
    dma_channel_enable(AUDIO_MAL_DMA_CHANNEL);

    /* if the I2S peripheral is still not enabled, enable it */
    if ((SPI_I2SCTL(CODEC_I2S) & I2S_ENABLE_MASK) == 0) {
        i2s_enable(CODEC_I2S);
    }
}


/*!
    \brief      pauses or resumes the audio stream playing from the media
    \param[in]  cmd: AUDIO_PAUSE (or 0) to pause, AUDIO_RESUME (or any value different from 0) to resume
    \param[in]  addr: address from/at which the audio stream should resume/pause	
    \param[in]  size: number of data to be configured for next resume
    \param[out] none
    \retval     none
*/
void audio_mal_pauseresume(uint32_t cmd, uint32_t addr, uint32_t size)
{
    /* pause the audio file playing */
    if (cmd == AUDIO_PAUSE) {
        /* stop the current DMA request by resetting the I2S cell */
        codec_audiointerface_deinit();

        /* Re-configure the I2S interface for the next resume operation */
        codec_audiointerface_init(i2s_audiofreq);

        /* disable the DMA stream */
        dma_channel_disable(AUDIO_MAL_DMA_CHANNEL);

        /* clear the interrupt flag */
        dma_flag_clear(AUDIO_MAL_DMA_CHANNEL, AUDIO_MAL_DMA_FLAG_ALL);

        /* AUDIO_RESUME */
        } else {
        /* configure the buffer address and size */
        dma_initstructure.memory_addr = (uint32_t)addr;
        dma_initstructure.number = (uint32_t)(size*2);

        /* configure the DMA stream with the new parameters */
        dma_init(AUDIO_MAL_DMA_CHANNEL, &dma_initstructure);

        /* enable the I2S DMA stream*/
        dma_channel_enable(AUDIO_MAL_DMA_CHANNEL);

        /* if the i2s peripheral is still not enabled, enable it */
        if ((SPI_I2SCTL(CODEC_I2S) & I2S_ENABLE_MASK) == 0) {
            i2s_enable(CODEC_I2S);
        }
    }
}

/*!
    \brief      stops audio stream playing on the used media
    \param[in]  none
    \param[out] none
    \retval     none
*/
void audio_mal_stop(void)
{
    /* stop the transfer on the i2s side: stop and disable the DMA stream */
    dma_channel_disable(AUDIO_MAL_DMA_CHANNEL);

    /* clear all the DMA flags for the next transfer */
    dma_flag_clear(AUDIO_MAL_DMA_CHANNEL, AUDIO_MAL_DMA_FLAG_ALL);

    /* stop the current DMA request by resetting the i2s cell */
    codec_audiointerface_deinit();

    /* re-configure the i2s interface for the next play operation */
    codec_audiointerface_init(i2s_audiofreq);
}

